wrk2/dome/10KB/wrk-eth3-rep07.log
Running 30s test @ https://bench-eth2.netdev-lab.org/10k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.747ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.779ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.744ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.723ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.78ms  682.21us   8.16ms   68.06%
    Req/Sec     2.11k   207.65     2.89k    66.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.74ms
 75.000%    2.22ms
 90.000%    2.62ms
 99.000%    3.63ms
 99.900%    5.26ms
 99.990%    6.41ms
 99.999%    7.91ms
100.000%    8.16ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.420     0.000000            1         1.00
       0.919     0.100000        15926         1.11
       1.160     0.200000        31831         1.25
       1.365     0.300000        47706         1.43
       1.557     0.400000        63616         1.67
       1.742     0.500000        79563         2.00
       1.834     0.550000        87501         2.22
       1.925     0.600000        95433         2.50
       2.019     0.650000       103380         2.86
       2.117     0.700000       111368         3.33
       2.219     0.750000       119336         4.00
       2.273     0.775000       123287         4.44
       2.331     0.800000       127297         5.00
       2.391     0.825000       131175         5.71
       2.457     0.850000       135197         6.67
       2.529     0.875000       139128         8.00
       2.571     0.887500       141122         8.89
       2.617     0.900000       143114        10.00
       2.671     0.912500       145151        11.43
       2.729     0.925000       147108        13.33
       2.795     0.937500       149103        16.00
       2.833     0.943750       150068        17.78
       2.879     0.950000       151072        20.00
       2.931     0.956250       152033        22.86
       2.989     0.962500       153040        26.67
       3.059     0.968750       154017        32.00
       3.103     0.971875       154520        35.56
       3.157     0.975000       155025        40.00
       3.213     0.978125       155515        45.71
       3.291     0.981250       156007        53.33
       3.373     0.984375       156501        64.00
       3.427     0.985938       156750        71.11
       3.491     0.987500       157005        80.00
       3.573     0.989062       157249        91.43
       3.671     0.990625       157501       106.67
       3.793     0.992188       157744       128.00
       3.871     0.992969       157868       142.22
       3.965     0.993750       157995       160.00
       4.065     0.994531       158117       182.86
       4.179     0.995313       158243       213.33
       4.311     0.996094       158364       256.00
       4.407     0.996484       158430       284.44
       4.495     0.996875       158489       320.00
       4.627     0.997266       158552       365.71
       4.731     0.997656       158615       426.67
       4.875     0.998047       158676       512.00
       4.939     0.998242       158706       568.89
       5.039     0.998437       158738       640.00
       5.095     0.998633       158769       731.43
       5.179     0.998828       158801       853.33
       5.275     0.999023       158830      1024.00
       5.347     0.999121       158847      1137.78
       5.411     0.999219       158861      1280.00
       5.515     0.999316       158877      1462.86
       5.567     0.999414       158892      1706.67
       5.671     0.999512       158909      2048.00
       5.699     0.999561       158916      2275.56
       5.759     0.999609       158923      2560.00
       5.839     0.999658       158932      2925.71
       5.915     0.999707       158940      3413.33
       6.023     0.999756       158948      4096.00
       6.079     0.999780       158951      4551.11
       6.139     0.999805       158954      5120.00
       6.179     0.999829       158958      5851.43
       6.271     0.999854       158962      6826.67
       6.307     0.999878       158967      8192.00
       6.343     0.999890       158968      9102.22
       6.459     0.999902       158970     10240.00
       6.575     0.999915       158972     11702.86
       6.795     0.999927       158974     13653.33
       6.839     0.999939       158976     16384.00
       7.147     0.999945       158977     18204.44
       7.291     0.999951       158978     20480.00
       7.515     0.999957       158979     23405.71
       7.639     0.999963       158980     27306.67
       7.787     0.999969       158981     32768.00
       7.787     0.999973       158981     36408.89
       7.831     0.999976       158982     40960.00
       7.831     0.999979       158982     46811.43
       7.907     0.999982       158983     54613.33
       7.907     0.999985       158983     65536.00
       7.907     0.999986       158983     72817.78
       7.915     0.999988       158984     81920.00
       7.915     0.999989       158984     93622.86
       7.915     0.999991       158984    109226.67
       7.915     0.999992       158984    131072.00
       7.915     0.999993       158984    145635.56
       8.159     0.999994       158985    163840.00
       8.159     1.000000       158985          inf
#[Mean    =        1.776, StdDeviation   =        0.682]
#[Max     =        8.156, Total count    =       158985]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  239547 requests in 30.00s, 2.34GB read
Requests/sec:   7984.75
Transfer/sec:     79.93MB